In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\naz\appdata\local\programs\python\python310\lib\site-packages (2.2.3)
Requirement already satisfied: tzdata>=2022.7 in c:\users\naz\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\naz\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\naz\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: numpy>=1.22.4 in c:\users\naz\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2.2.1)
Requirement already satisfied: six>=1.5 in c:\users\naz\appdata\local\programs\python\python310\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 23.0.1 -> 25.1.1
[notice] To update, run: C:\Users\Naz\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

# Reading Data from various sources

### 1. csv

In [4]:
# Read_csv
df = pd.read_csv("./data/loans data.csv")
df

,ID,Amount.Requested,Amount.Funded.By.Investors,Interest.Rate,Loan.Length,Loan.Purpose,Debt.To.Income.Ratio,State,Home.Ownership,Monthly.Income,FICO.Range,Open.CREDIT.Lines,Revolving.CREDIT.Balance,Inquiries.in.the.Last.6.Months,Employment.Length
0,81174.0,20000,20000,8.90%,36 months,debt_consolidation,14.90%,SC,MORTGAGE,6541.67,735-739,14,14272,2.0,< 1 year
1,99592.0,19200,19200,12.12%,36 months,debt_consolidation,28.36%,TX,MORTGAGE,4583.33,715-719,12,11140,1.0,2 years
2,80059.0,35000,35000,21.98%,60 months,debt_consolidation,23.81%,CA,MORTGAGE,11500.00,690-694,14,21977,1.0,2 years
3,15825.0,10000,9975,9.99%,36 months,debt_consolidation,14.30%,KS,MORTGAGE,3833.33,695-699,10,9346,0.0,5 years
4,33182.0,12000,12000,11.71%,36 months,credit_card,18.78%,NJ,RENT,3195.00,695-699,11,14469,0.0,9 years
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2495,23735.0,30000,29950,16.77%,60 months,debt_consolidation,19.23%,NY,MORTGAGE,9250.00,705-709,15,45880,1.0,8 years
2496,65882.0,16000,16000,14.09%,60 months,home_improvement,21.54%,MD,OWN,8903.25,740-744,18,18898,1.0,10+ years
2497,55610.0,10000,10000,13.99%,36 months,debt_consolidation,4.89%,PA,MORTGAGE,2166.67,680-684,4,4544,0.0,10+ years
2498,38576.0,6000,6000,12.42%,36 months,major_purchase,16.66%,NJ,RENT,3500.00,675-679,8,.,0.0,5 years
2499,3116.0,9000,5242.75,13.79%,36 months,debt_consolidation,6.76%,NY,RENT,3875.00,670-674,7,7589,0.0,10+ years

In [15]:
# df.shape

In [16]:
# df.head(3)

In [17]:
# df.info()

In [20]:
bank_df = pd.read_csv("./data/bank-full.csv",sep = ";")
bank_df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no

In [44]:
# to_csv

df.to_csv("./data/loans_copy.csv",index = False)

### 2. excel

In [ ]:
!pip install openpyxl

In [45]:
# Read excel file
df = pd.read_excel("./data/Sales Order.xlsx")
df.head()

,Order ID,Unique ID,Customer,City,Quantity,Price,Total Sale Amount
0,NJ-2016-152156,NJ-2016-TT-107,Raymond Young,Troy,6,12.42,74.52
1,NJ-2016-138688,NJ-2016-PC-944,Helen Dean,Westfield,7,12.42,86.94
2,WA-2015-108966,WA-2015-TQ-107,Shirley Chavez,Seattle,2,16.32,32.64
3,NJ-2014-115812,NJ-2014-ZI-111,Brian Ryan,Westfield,1,12.42,12.42
4,NJ-2017-114412,NJ-2017-JR-537,Benjamin Willis,Westfield,3,17.83,53.49

In [46]:
df.shape

(5000, 7)

In [47]:
# Reading a specific sheet
df = pd.read_excel("./data/Sales Order.xlsx", sheet_name = 'Returns')
df.head()

         Order ID        Unique ID         Customer       City       State
0  NJ-2016-273214  NJ-ZKDFQ-821902    Raymond Young       Troy    New York
1  NJ-2016-271456  NJ-UTHRK-895117       Helen Dean  Westfield  New Jersey
2  WA-2015-451988  WA-ETBAQ-135442   Shirley Chavez    Seattle  Washington
3  NJ-2014-352961  NJ-EHGXM-601830       Brian Ryan  Westfield  New Jersey
4  NJ-2017-213231  NJ-CJFQS-287500  Benjamin Willis  Westfield  New Jersey

In [48]:
df.shape

(2000, 5)

In [50]:
# Get all sheets
data_all = pd.read_excel("./data/Sales Order.xlsx", sheet_name=None)
data_all.keys()

dict_keys(['Orders', 'Returns', 'Sheet1'])

In [51]:
data_all['Sheet1']

,EmpID,Name,Age,Experience,Unnamed: 4,Unnamed: 5,EmpID.1,Salary,Increment,Unnamed: 9,Unnamed: 10,EmpID.2,City
0,111,Amit,31,5,NaN,NaN,111,76804,8448,NaN,NaN,111,Goa
1,222,Jeena,31,2,NaN,NaN,222,70350,8442,NaN,NaN,222,New York City
2,333,John,36,4,NaN,NaN,333,86907,9559,NaN,NaN,333,Troy
3,444,Vivek,35,9,NaN,NaN,444,77576,7757,NaN,NaN,444,Mumbai
4,555,Luke,40,6,NaN,NaN,555,59766,5976,NaN,NaN,555,Chennai
5,666,Harris,36,1,NaN,NaN,666,55001,4950,NaN,NaN,666,Delhi
6,777,Warner,32,3,NaN,NaN,777,55673,5010,NaN,NaN,777,Gurgaon
7,888,Dravid,34,1,NaN,NaN,888,54940,5494,NaN,NaN,888,Noida
8,999,Rahul,37,8,NaN,NaN,999,78865,7886,NaN,NaN,999,Portland

In [52]:
df

,Order ID,Unique ID,Customer,City,State
0,NJ-2016-273214,NJ-ZKDFQ-821902,Raymond Young,Troy,New York
1,NJ-2016-271456,NJ-UTHRK-895117,Helen Dean,Westfield,New Jersey
2,WA-2015-451988,WA-ETBAQ-135442,Shirley Chavez,Seattle,Washington
3,NJ-2014-352961,NJ-EHGXM-601830,Brian Ryan,Westfield,New Jersey
4,NJ-2017-213231,NJ-CJFQS-287500,Benjamin Willis,Westfield,New Jersey
...,...,...,...,...,...
1995,OR-2014-443372,OR-MLTKR-791554,Kevin Garza,Portland,Oregon
1996,MA-2015-302053,MA-UZNIC-531357,Walter Kennedy,Lowell,Massachusetts
1997,NJ-2015-406754,NJ-JGMKR-831919,Shirley Morrison,Troy,New York
1998,CA-2017-214601,CA-RKJDJ-698676,Rachel Stanley,Los Angeles,California
1999,OR-2015-206233,OR-KUARX-249729,Teresa Fisher,Portland,Oregon

In [53]:
df.to_excel("./data/Varroc Sales.xlsx", index = False)

In [55]:
# Writing to multiple sheets

filename = './data/Varroc Sales.xlsx'
writer = pd.ExcelWriter(filename, engine = 'xlsxwriter')
for city in df['City'].unique():
    newdf = df[df['City'] == city]
    newdf.to_excel(writer, sheet_name = city, index = False)
writer.close()

In [56]:
# combine multiple sheets to one sheet

src_file = './data/Varroc Sales.xlsx'
sheets = list(pd.read_excel(src_file,sheet_name = None).keys())          # sheet_name = None (to get all sheets)
df = pd.DataFrame()
for sheet in sheets:
    df = pd.concat([df, pd.read_excel(src_file, sheet_name=sheet)])
df

          Order ID        Unique ID            Customer       City     State
0   NJ-2016-273214  NJ-ZKDFQ-821902       Raymond Young       Troy  New York
1   NJ-2015-349463   NJ-UZRZR-75004    Christina Little       Troy  New York
2   NJ-2014-162733  NJ-FFAAD-686418       Ruby Matthews       Troy  New York
3   NJ-2014-315445  NJ-ESWPJ-869516  Christopher Oliver       Troy  New York
4   NJ-2015-210899  NJ-AEZFJ-560402       Gloria Harper       Troy  New York
..             ...              ...                 ...        ...       ...
47  NV-2014-375133  NV-BTIDY-201246      Laura Mcdonald  Las Vegas    Nevada
48  NV-2015-450497  NV-UYIPB-418819        Stephen Rice  Las Vegas    Nevada
49   NV-2017-98131  NV-IVETR-338802          Doris Diaz  Las Vegas    Nevada
50    NV-2017-8698  NV-GIALU-684311        Stephen Rice  Las Vegas    Nevada
51  NV-2017-139194  NV-NOTYY-446462       Sandra Hughes  Las Vegas    Nevada

[2000 rows x 5 columns]

In [ ]:
# df.to_excel('./data/File100.xlsx', sheet_name='Combined_data', index = False)

### 3. Database Tables

##### 3.1 mysql

In [ ]:
# !pip install sqlalchemy
# !pip install pymysql

In [ ]:
# https://docs.sqlalchemy.org/en/20/core/engines.html

In [66]:
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:12345@localhost/awgc')  # create_engine(url_string)
engine

Engine(mysql+pymysql://root:***@localhost/awgc)

In [67]:
df = pd.read_sql("SELECT * FROM employee", con=engine)
df

,EmployeeID,FirstName,LastName,Email,PhoneNumber,HireDate,JobTitle,Salary,DepartmentID
0,1,John,Doe,john.doe@example.com,555-1234,2020-01-15,Manager,75000.0,10
1,2,Jane,Smith,jane.smith@example.com,555-5678,2019-04-22,Developer,65000.0,20
2,3,Sam,Brown,sam.brown@example.com,555-8765,2021-07-19,Analyst,55000.0,30

In [68]:
df.to_sql('VarrocEmployees', con = engine)

C:\Users\Naz\AppData\Local\Temp\ipykernel_21324\626798314.py:1: UserWarning: The provided table name 'VarrocEmployees' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df.to_sql('VarrocEmployees', con = engine)

3

##### 3.2 postgresql

In [ ]:
# !pip install psycopg2

In [65]:
engine = create_engine("postgresql+psycopg2://postgres:12345@localhost/awgc")
df = pd.read_sql('SELECT * FROM location', con = engine)
df

   location_id      city
0          122  New York
1          123    Dallas
2          124   Chicago
3          167    Boston

In [8]:
df['Country'] = 'USA'
df

   location_id      city Country
0          122  New York     USA
1          123    Dallas     USA
2          124   Chicago     USA
3          167    Boston     USA

In [9]:
df.to_sql('US_Loc', con=engine, index=False, if_exists='replace')

4

In [94]:
from sqlalchemy import create_engine

engine = create_engine("sqlite:///books.db")
engine

Engine(sqlite:///books.db)

In [95]:
df = pd.read_sql("Select * from books", con = engine)
df

   id     title             author  year
0   1       abc                xyz  2025
1   2  Let us C  Yashwant kanetkar  1988

In [105]:
new_df = pd.DataFrame([{'id': 555,
'title': 'def',
'author': 'uvw',
'year': 1950}])
new_df

    id title author  year
0  555   def    uvw  1950

In [101]:
new_df.to_sql('books',con = engine, index = False, if_exists='append')

1

In [102]:
pd.read_sql("Select * from books", con = engine)

    id                  title             author  year
0    1                    abc                xyz  2025
1    2               Let us C  Yashwant kanetkar  1988
2   50  Enginnering mechanics             Sanjay  2000
3  555                    def                uvw  1950

# Core components of pandas
1. pandas Series 
2. pandas DataFrame : index, columns, values

# Extracting rows, columns from data frames (loc,iloc)

In [137]:
df = pd.read_excel('./data/Sales Order.xlsx')
df.head(2)

,Order ID,Unique ID,Customer,City,Quantity,Price,Total Sale Amount
0,NJ-2016-152156,NJ-2016-TT-107,Raymond Young,Troy,6,12.42,74.52
1,NJ-2016-138688,NJ-2016-PC-944,Helen Dean,Westfield,7,12.42,86.94

#### 1. iloc : Integer Locate
- df.iloc[row_no,col_no]

In [149]:
# df.iloc[1,0]

In [150]:
# df.iloc[0,0]

In [151]:
# df.iloc[1,5]

In [152]:
# df.iloc[[0,1],[3,5]]

In [153]:
# df.iloc[:,[4,5]]

In [154]:
# df.iloc[:,:]

In [155]:
# df.iloc[1:5,4:6]

In [156]:
# df.iloc[-4:,:]

In [157]:
# df.iloc[::2,:]

In [159]:
# df.iloc[3000:4000,:]

In [165]:
# df.iloc[0:1,1:0]

#### 2.loc
- df.loc[index_name,col_name]

# Conditional Filtering

In [212]:
# get all records for texas

(174, 15)

In [201]:
# get all records where state is texas or New Jersey

(268, 15)

In [208]:
# get all records where home ownership is mortgage

(1147, 15)

In [210]:
# get all records where state is texas or New Jersey and LoanPurpose is debtconsolidation

(132, 15)

In [213]:
# get all records where home ownership is not mortgage

(1353, 15)

In [214]:
# get all records where State is NJ,SC or NY

(377, 15)

In [217]:
# Get NJ records with Loan purpose as either home_improvement/major purchase and monthly income < 5000

,ID,Amount.Requested,Amount.Funded.By.Investors,Interest.Rate,Loan.Length,Loan.Purpose,Debt.To.Income.Ratio,State,Home.Ownership,Monthly.Income,FICO.Range,Open.CREDIT.Lines,Revolving.CREDIT.Balance,Inquiries.in.the.Last.6.Months,Employment.Length
88,33777.0,6000,.,7.51%,36 months,home_improvement,2.52%,NJ,MORTGAGE,4800.00,750-754,.,1442,0.0,10+ years
1029,54274.0,8000,8000,12.12%,36 months,home_improvement,7.90%,NJ,MORTGAGE,4166.67,705-709,6,7419,1.0,NaN
2498,38576.0,6000,6000,12.42%,36 months,major_purchase,16.66%,NJ,RENT,3500.00,675-679,8,.,0.0,5 years

In [221]:
# Get non NJ records with Loan purpose except home_improvement/major purchase and monthly income < 1000

,ID,Amount.Requested,Amount.Funded.By.Investors,Interest.Rate,Loan.Length,Loan.Purpose,Debt.To.Income.Ratio,State,Home.Ownership,Monthly.Income,FICO.Range,Open.CREDIT.Lines,Revolving.CREDIT.Balance,Inquiries.in.the.Last.6.Months,Employment.Length
375,97462.0,1000,1000,22.95%,36 months,other,19.78%,NY,RENT,884.90,665-669,4,5561,0.0,NaN
866,10737.0,4750,4750,14.72%,36 months,small_business,3%,CO,OWN,866.67,660-664,6,740,0.0,NaN
985,17.0,5400,200,7.75%,36 months,educational,3%,GA,RENT,666.67,760-764,4,1321,0.0,< 1 year
1686,101612.0,3000,2275,13.75%,36 months,educational,2.38%,FL,OWN,588.50,640-644,4,469,0.0,8 years
2180,14231.0,1450,1450,7.51%,36 months,other,22.20%,MA,RENT,833.33,740-744,9,709,0.0,NaN